编程绝对不是那么简单的事情，尤其是自学，在没有任何指导的情况下，仅仅依靠网络，0基础学习编程处处是高峰。
我在这里梳理下我一路走来的坑，不知道试错了多少次才给我自己留下这样一笔宝贵的经历与财富，或许也能帮到0基础学习编程的你。

1. 必备的科学上网技能。（自己去琢磨搜索解决，这一步卡死90%的人）

2. 选择一个想要学习的语言，我将以**Go**语言为例。
（0基础你能了解什么呢？听说Go语言很厉害，那就来吧，不要管难或不难。
因为90%的人在了解了一圈后，依然没有前进一步，然后就没有然后了。）

3. 选择一个编辑器，我是在看过很多视频教程后选择一款编辑器——Sublime Text3。
（很长一段时间我不知道要在哪里写代码。。。当你找到后你便不觉得那是个高峰，但没找到时，它就是个高峰。
你也不要陷入使用什么编辑器的纠结中，重要的是选择并使用。）

4. 安装Git，管理你的本地代码。（重要到不行的东西）

5. 申请Github，把你的代码托管在云端。（多写代码多上传）

有了以上技能后应该算入门了，摒弃掉一个观念认为入门是一瞬间的事。
从门外到门内一需要一步即可，非也非也。
这个门是个深深的门洞，需要你有耐心慢慢摸索尝试，花费一定时间（可能很长）才能从门外走入门内。
也就是因为很多人只走了一步，发现并没有像想象那样入门了，所以放弃算球。

放弃在这个时候很简单。

接下来你是打算有耐心的入门，然后探索新的世界呢？还是走一步就放弃呢？或许你已经习惯放弃。
你随意，但不管我的事。